# Series

In [1]:
label=['a','b','c','d']
data=[10,20,30,40]
dic={'a':10,'b':20,'c':30,'d':40}

In [2]:
import pandas as pd

In [3]:
pd.Series(data=data,index=label)

a    10
b    20
c    30
d    40
dtype: int64

In [4]:
pd.Series(data=data)

0    10
1    20
2    30
3    40
dtype: int64

In [5]:
ser1=pd.Series([1,2,3,4],['IRR','CAD','USD','TRL'])

In [6]:
ser1

IRR    1
CAD    2
USD    3
TRL    4
dtype: int64

In [7]:
ser2=pd.Series([1,2,3,4],['IRR','CAD','POl','TRL'])

In [8]:
ser2

IRR    1
CAD    2
POl    3
TRL    4
dtype: int64

In [9]:
ser1+ser2

CAD    4.0
IRR    2.0
POl    NaN
TRL    8.0
USD    NaN
dtype: float64

In [2]:
import numpy as np
import pandas as pd

In [3]:
from numpy.random import randn

In [4]:
a=randn(2)
a

array([ 0.57943617, -0.16049785])

In [5]:
np.random.seed(101)

In [50]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A -0.610259 -0.755325 -0.346419  0.147027
B -0.479448  0.558769  1.024810 -0.925874
C  1.862864 -1.133817  0.610478  0.386030
D  2.084019 -0.376519  0.230336  0.681209
E  1.035125 -0.031160  1.939932 -1.005187

In [51]:
df['X']

A   -0.755325
B    0.558769
C   -1.133817
D   -0.376519
E   -0.031160
Name: X, dtype: float64

In [52]:
df['X']['A']

-0.755325340010558

In [53]:
df.X

A   -0.755325
B    0.558769
C   -1.133817
D   -0.376519
E   -0.031160
Name: X, dtype: float64

In [54]:
df.drop('Y',axis=1,inplace=True)

In [55]:
df

          W         X         Z
A -0.610259 -0.755325  0.147027
B -0.479448  0.558769 -0.925874
C  1.862864 -1.133817  0.386030
D  2.084019 -0.376519  0.681209
E  1.035125 -0.031160 -1.005187

In [56]:
df['New']=randn(5,1)

In [57]:
df

          W         X         Z       New
A -0.610259 -0.755325  0.147027 -0.741790
B -0.479448  0.558769 -0.925874  0.187125
C  1.862864 -1.133817  0.386030 -0.732845
D  2.084019 -0.376519  0.681209 -1.382920
E  1.035125 -0.031160 -1.005187  1.482495

In [58]:
 df.loc['A']

W     -0.610259
X     -0.755325
Z      0.147027
New   -0.741790
Name: A, dtype: float64

In [59]:
df.iloc[2]

W      1.862864
X     -1.133817
Z      0.386030
New   -0.732845
Name: C, dtype: float64

In [61]:
df.loc['B','X']

0.558769406443067

In [62]:
df.loc[['A','B'],['X','Z']]

          X         Z
A -0.755325  0.147027
B  0.558769 -0.925874

In [63]:
df

          W         X         Z       New
A -0.610259 -0.755325  0.147027 -0.741790
B -0.479448  0.558769 -0.925874  0.187125
C  1.862864 -1.133817  0.386030 -0.732845
D  2.084019 -0.376519  0.681209 -1.382920
E  1.035125 -0.031160 -1.005187  1.482495

# Rename Column

In [64]:
df.rename({'Z':'Y','New':'Z'},axis=1,inplace=True)

In [68]:
df

          W         X         Y         Z
A -0.610259 -0.755325  0.147027 -0.741790
B -0.479448  0.558769 -0.925874  0.187125
C  1.862864 -1.133817  0.386030 -0.732845
D  2.084019 -0.376519  0.681209 -1.382920
E  1.035125 -0.031160 -1.005187  1.482495

# Condition

In [69]:
df>0

       W      X      Y      Z
A  False  False   True  False
B  False   True  False   True
C   True  False   True  False
D   True  False   True  False
E   True  False  False   True

In [72]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN  0.147027       NaN
B       NaN  0.558769       NaN  0.187125
C  1.862864       NaN  0.386030       NaN
D  2.084019       NaN  0.681209       NaN
E  1.035125       NaN       NaN  1.482495

In [73]:
condition=df>0

In [74]:
df[condition]

          W         X         Y         Z
A       NaN       NaN  0.147027       NaN
B       NaN  0.558769       NaN  0.187125
C  1.862864       NaN  0.386030       NaN
D  2.084019       NaN  0.681209       NaN
E  1.035125       NaN       NaN  1.482495

In [76]:
df[condition]['W']

A         NaN
B         NaN
C    1.862864
D    2.084019
E    1.035125
Name: W, dtype: float64

In [78]:
df['W']

A   -0.610259
B   -0.479448
C    1.862864
D    2.084019
E    1.035125
Name: W, dtype: float64

In [79]:
df['W']>0

A    False
B    False
C     True
D     True
E     True
Name: W, dtype: bool

In [84]:
df[df['W']>0]

          W         X         Y         Z
C  1.862864 -1.133817  0.386030 -0.732845
D  2.084019 -0.376519  0.681209 -1.382920
E  1.035125 -0.031160 -1.005187  1.482495

In [89]:
df[df['W']>0][['X','Y']]

          X         Y
C -1.133817  0.386030
D -0.376519  0.681209
E -0.031160 -1.005187

In [90]:
df

          W         X         Y         Z
A -0.610259 -0.755325  0.147027 -0.741790
B -0.479448  0.558769 -0.925874  0.187125
C  1.862864 -1.133817  0.386030 -0.732845
D  2.084019 -0.376519  0.681209 -1.382920
E  1.035125 -0.031160 -1.005187  1.482495

# And

In [92]:
df[(df['W']>0) & (df['Y']>0)]

          W         X         Y         Z
C  1.862864 -1.133817  0.386030 -0.732845
D  2.084019 -0.376519  0.681209 -1.382920

In [107]:
df[(df['W']>0) & (df['Y']>0)]

          W         X         Y         Z
C  1.862864 -1.133817  0.386030 -0.732845
D  2.084019 -0.376519  0.681209 -1.382920

# Or

In [114]:
df[(df['W']>0) | (df['Y']>0)]

          W         X         Y         Z
A -0.610259 -0.755325  0.147027 -0.741790
C  1.862864 -1.133817  0.386030 -0.732845
D  2.084019 -0.376519  0.681209 -1.382920
E  1.035125 -0.031160 -1.005187  1.482495

In [115]:
df.loc["A"]

W   -0.610259
X   -0.755325
Y    0.147027
Z   -0.741790
Name: A, dtype: float64

In [118]:
df.loc[['A','D']][['W','Y']]

          W         Y
A -0.610259  0.147027
D  2.084019  0.681209

# Reset_index

In [119]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.610259 -0.755325  0.147027 -0.741790
1     B -0.479448  0.558769 -0.925874  0.187125
2     C  1.862864 -1.133817  0.386030 -0.732845
3     D  2.084019 -0.376519  0.681209 -1.382920
4     E  1.035125 -0.031160 -1.005187  1.482495

In [120]:
df

          W         X         Y         Z
A -0.610259 -0.755325  0.147027 -0.741790
B -0.479448  0.558769 -0.925874  0.187125
C  1.862864 -1.133817  0.386030 -0.732845
D  2.084019 -0.376519  0.681209 -1.382920
E  1.035125 -0.031160 -1.005187  1.482495

# Set_index

In [121]:
new_index='AB CD EF GH IJ'.split()

In [122]:
new_index

['AB', 'CD', 'EF', 'GH', 'IJ']

In [123]:
df['index']=new_index

In [124]:
df

          W         X         Y         Z index
A -0.610259 -0.755325  0.147027 -0.741790    AB
B -0.479448  0.558769 -0.925874  0.187125    CD
C  1.862864 -1.133817  0.386030 -0.732845    EF
D  2.084019 -0.376519  0.681209 -1.382920    GH
E  1.035125 -0.031160 -1.005187  1.482495    IJ

In [125]:
df.set_index('index')

              W         X         Y         Z
index
AB    -0.610259 -0.755325  0.147027 -0.741790
CD    -0.479448  0.558769 -0.925874  0.187125
EF     1.862864 -1.133817  0.386030 -0.732845
GH     2.084019 -0.376519  0.681209 -1.382920
IJ     1.035125 -0.031160 -1.005187  1.482495

# Pandas Part3

# Zip Two List and Convert to List

In [136]:
out_side=['G1','G1','G1','G2','G2','G2']
inside=['1','2','3','1','2','3']
zip_out_inside=zip(out_side,inside)
list_out_inside=list(zip_out_inside)
list_out_inside

[('G1', '1'), ('G1', '2'), ('G1', '3'), ('G2', '1'), ('G2', '2'), ('G2', '3')]

In [137]:
result=pd.MultiIndex.from_tuples(list_out_inside)
result

MultiIndex([('G1', '1'),
            ('G1', '2'),
            ('G1', '3'),
            ('G2', '1'),
            ('G2', '2'),
            ('G2', '3')],
           )

In [138]:
df=pd.DataFrame(randn(6,2),result,['A','B'])
df

             A         B
G1 1 -0.855196  1.541990
   2  0.666319 -0.538235
   3 -0.568581  1.407338
G2 1  0.641806 -0.905100
   2 -0.391157  1.028293
   3 -1.972605 -0.866885

In [143]:
df.loc['G1']

0.6663193209198146

In [144]:
df.loc['G1'].loc['2']

A    0.666319
B   -0.538235
Name: 2, dtype: float64

In [146]:
df.loc['G1'].loc['2']['A']

0.6663193209198146

In [147]:
df

             A         B
G1 1 -0.855196  1.541990
   2  0.666319 -0.538235
   3 -0.568581  1.407338
G2 1  0.641806 -0.905100
   2 -0.391157  1.028293
   3 -1.972605 -0.866885

# Give Name to dataFrame column

In [148]:
df.index.names=['outer','inner']

In [149]:
df

                    A         B
outer inner
G1    1     -0.855196  1.541990
      2      0.666319 -0.538235
      3     -0.568581  1.407338
G2    1      0.641806 -0.905100
      2     -0.391157  1.028293
      3     -1.972605 -0.866885

In [150]:
df.loc['G1']

              A         B
inner
1     -0.855196  1.541990
2      0.666319 -0.538235
3     -0.568581  1.407338

# Use XS for cross section to access data in inner layer

In [151]:
df.xs('G1')

              A         B
inner
1     -0.855196  1.541990
2      0.666319 -0.538235
3     -0.568581  1.407338

In [155]:
df.xs('2',level='inner')

              A         B
outer
G1     0.666319 -0.538235
G2    -0.391157  1.028293

# Create Dataframe

In [157]:
df=pd.DataFrame(randn(6,2),range(6),['A','B'])
df

          A         B
0  0.649148  0.358941
1 -1.080471  0.902398
2  0.161781  0.833029
3  0.975720 -0.388239
4  0.783316 -0.708954
5  0.586847 -1.621348

In [164]:
dic={'A':[1,2,3,4,np.nan],'B':[2,4,6,7,np.nan],'C':[7,1,np.nan,3,np.nan],'D':[7,1,2,3,7]}
df1=pd.DataFrame(dic)
df1

     A    B    C  D
0  1.0  2.0  7.0  7
1  2.0  4.0  1.0  1
2  3.0  6.0  NaN  2
3  4.0  7.0  3.0  3
4  NaN  NaN  NaN  7

# Missing Value

# Drop

In [165]:
df1.dropna()

     A    B    C  D
0  1.0  2.0  7.0  7
1  2.0  4.0  1.0  1
3  4.0  7.0  3.0  3

In [166]:
df1.dropna(axis=1)

   D
0  7
1  1
2  2
3  3
4  7

In [168]:
df1

     A    B    C  D
0  1.0  2.0  7.0  7
1  2.0  4.0  1.0  1
2  3.0  6.0  NaN  2
3  4.0  7.0  3.0  3
4  NaN  NaN  NaN  7

# Fill Missing Value

In [169]:
df1.fillna(value="Hello")

       A      B      C  D
0    1.0    2.0    7.0  7
1    2.0    4.0    1.0  1
2    3.0    6.0  Hello  2
3    4.0    7.0    3.0  3
4  Hello  Hello  Hello  7

In [172]:
df1['A'].fillna(value=df1['A'].mean())

0    1.0
1    2.0
2    3.0
3    4.0
4    2.5
Name: A, dtype: float64

# Group By    Aggregate Functions

In [190]:
dic1={'Company':['GOOG','GOOG','MFSD','MFSD','FB','FB'],
     'Person':['Sam','Emy','Charli','Asghar','Akbar','Sarah'],
     'Sales':[200,100,120,80,90,100]}

In [191]:
df_new=pd.DataFrame(dic1)
df_new

  Company  Person  Sales
0    GOOG     Sam    200
1    GOOG     Emy    100
2    MFSD  Charli    120
3    MFSD  Asghar     80
4      FB   Akbar     90
5      FB   Sarah    100

In [192]:
df_new.groupby('Company')

In [193]:
group_column=df_new.groupby('Company')

In [194]:
group_column

In [195]:
group_column.mean()

         Sales
Company
FB          95
GOOG       150
MFSD       100

In [196]:
group_column.sum()

         Sales
Company
FB         190
GOOG       300
MFSD       200

In [197]:
group_column.std()

             Sales
Company
FB        7.071068
GOOG     70.710678
MFSD     28.284271

In [204]:
group_column.sum()

         Sales
Company
FB         190
GOOG       300
MFSD       200

In [205]:
group_column.sum().loc['FB']

Sales    190
Name: FB, dtype: int64

In [206]:
df_new.groupby('Company').sum().loc['FB']

Sales    190
Name: FB, dtype: int64

In [208]:
df_new.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MFSD          2      2

In [209]:
df_new.groupby('Company').max()

         Person  Sales
Company
FB        Sarah    100
GOOG        Sam    200
MFSD     Charli    120

In [210]:
df_new.groupby('Company').min()

         Person  Sales
Company
FB        Akbar     90
GOOG        Emy    100
MFSD     Asghar     80

In [211]:
df_new.groupby('Company').describe()

        Sales
        count   mean        std    min    25%    50%    75%    max
Company
FB        2.0   95.0   7.071068   90.0   92.5   95.0   97.5  100.0
GOOG      2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0
MFSD      2.0  100.0  28.284271   80.0   90.0  100.0  110.0  120.0

In [212]:
df_new.groupby('Company').describe().loc['FB']

Sales  count      2.000000
       mean      95.000000
       std        7.071068
       min       90.000000
       25%       92.500000
       50%       95.000000
       75%       97.500000
       max      100.000000
Name: FB, dtype: float64

In [214]:
df_new.groupby('Company').describe().transpose()

Company              FB        GOOG        MFSD
Sales count    2.000000    2.000000    2.000000
      mean    95.000000  150.000000  100.000000
      std      7.071068   70.710678   28.284271
      min     90.000000  100.000000   80.000000
      25%     92.500000  125.000000   90.000000
      50%     95.000000  150.000000  100.000000
      75%     97.500000  175.000000  110.000000
      max    100.000000  200.000000  120.000000

In [215]:
df_new.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean      95.000000
       std        7.071068
       min       90.000000
       25%       92.500000
       50%       95.000000
       75%       97.500000
       max      100.000000
Name: FB, dtype: float64

# Merge  Join Concat

In [222]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3'],
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']
},index=[0,1,2,3])

In [223]:
df2=pd.DataFrame({'A':['A4','A5','A6','A7'],
                  'B':['B4','B5','B6','B7'],
                  'C':['C4','C5','C6','C7'],
                  'D':['D4','D5','D6','D7']
    
},index=[4,5,6,7])

In [228]:
df3=pd.DataFrame({'A':['A8','A9','A10','A11'],
                  'B':['B8','B9','B10','B11'],
                  'C':['C8','C9','C10','C11'],
                  'D':['D8','D9','D10','D11']
    
},index=[8,9,10,11])

In [225]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [226]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [229]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

# Concat

In [230]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [234]:
df_concat=pd.concat([df1,df2,df3],axis=1)
df_concat

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [236]:
df_concat

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [240]:
left=pd.DataFrame({'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3'],
                   'key':['K0','K1','K2','K3']},index=[0,1,2,3])

right=pd.DataFrame({'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3'],
                   'key':['K0','K1','K2','K3']},index=[0,1,2,3])

In [241]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [245]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [262]:
pd.merge(left,right,how='inner',on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [263]:
pd.merge(left,right,how='outer',on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [264]:
pd.merge(left,right,how='left',on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [265]:
pd.merge(left,right,how='right',on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [7]:
import pandas as pd
left1=pd.DataFrame({'key1':['K0','K0','K1','K2'],
                   'key2':['K0','K1','K0','K1'],
                   'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3']},
                  )

right1=pd.DataFrame({'key1':['K0','K1','K1','K2'],
                   'key2':['K0','K0','K0','K0'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']},
                  )

In [8]:
left1

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [9]:
right1

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [10]:
pd.merge(left1,right1,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [11]:
pd.merge(left1,right1,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [12]:
pd.merge(left1,right1,how='left',on=['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [14]:
pd.merge(left1,right1,how='right',on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

# Join

In [15]:
left2=pd.DataFrame({'A':['A0','A1','A2'],
                    'B':['B0','B1','B2']},
                   index=['k0','k1','k2'])
right2=pd.DataFrame({'C':['C0','C2','C3'],
                     'D':['D0','D2','D3']},
                    index=['k0','k2','k3'])

In [16]:
left2

     A   B
k0  A0  B0
k1  A1  B1
k2  A2  B2

In [17]:
right2

     C   D
k0  C0  D0
k2  C2  D2
k3  C3  D3

In [18]:
left2.join(right2)

     A   B    C    D
k0  A0  B0   C0   D0
k1  A1  B1  NaN  NaN
k2  A2  B2   C2   D2

In [19]:
left2.join(right2, how='inner')

     A   B   C   D
k0  A0  B0  C0  D0
k2  A2  B2  C2  D2

In [20]:
left2.join(right2, how='outer')

      A    B    C    D
k0   A0   B0   C0   D0
k1   A1   B1  NaN  NaN
k2   A2   B2   C2   D2
k3  NaN  NaN   C3   D3

In [21]:
left2.join(right2, how='left')

     A   B    C    D
k0  A0  B0   C0   D0
k1  A1  B1  NaN  NaN
k2  A2  B2   C2   D2

In [22]:
left2.join(right2, how='right')

      A    B   C   D
k0   A0   B0  C0  D0
k2   A2   B2  C2  D2
k3  NaN  NaN  C3  D3

# Pandas Operations

In [23]:
import pandas as pd
import numpy as np

In [26]:
df=pd.DataFrame({'col1':[1,2,3,4],
                 'col2':[444,555,666,444],
                 'col3':['abc','def','ghi','xyz']
                })

In [27]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [28]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [30]:
df['col2'].unique()

array([444, 555, 666])

In [31]:
len(df['col2'].unique())

3

In [32]:
df['col2'].nunique()

3

In [34]:
df['col2'].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

In [35]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [36]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [37]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [39]:
df[(df['col1']>2) & (df['col2']>444)]

   col1  col2 col3
2     3   666  ghi

# Apply Function

In [40]:
def times2(item):
    return item*2

In [42]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [ ]:
df['col1'].apply(len)

In [46]:
a=lambda item: item*2
df['col2'].apply(a)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [47]:
df['col2'].apply(lambda item: item**2)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [57]:
df['col2'].sum()

2109

# Remove Column

In [51]:
df.drop('col2',axis=1)

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [52]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# Get the Columns

In [53]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

# Get the Index

In [54]:
df.index

RangeIndex(start=0, stop=4, step=1)

# Sort

In [60]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

# Check Null

In [59]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# Pivot Method

In [61]:
data={'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
     'C':['x','y','x','y','x','y'],
     'D':[1,3,2,4,5,1]}

In [64]:
df1=pd.DataFrame(data)
df1

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  4
4  bar  one  x  5
5  bar  one  y  1

In [70]:
df1.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  5.0  1.0
    two  NaN  4.0
foo one  1.0  3.0
    two  2.0  NaN

# Pandas Input & Output
   Pandas Read & Write
   CSV / HTML / SQL / Excel

In [71]:
import pandas as pd

# Input CSV File

In [72]:
df=pd.read_csv('sample.csv')

FileNotFoundError: [Errno 2] No such file or directory: 'sample.csv'

In [ ]:
df1=pd.read_excel("Sample",sheet_name='Sheet1')

# Output CSV File

In [ ]:
df.to_csv('My_file',index=False)

In [ ]:
df1.to_excel('My_file2',sheet_name='new_sheet')